{
  "projects": [
        {
      "title": "Insurance Application",
      "stack": ["Spring Boot", "React Native", "JavaFX"],
      "description": "The project involved developing an Insurance Application, integrating a Spring Boot backend and JavaFX and React Native frontends. Security measures like OWASP ZAP and SonarLint scans were implemented to prevent vulnerabilities. JWT was utilized for secure and efficient user authentication. The server was dockerized",
      "image": "assets/projects/SecureAndInteroperableInsuranceApplication.png",
      "url": "https://github.com/MrCharlesSG/Insurance-Documentation"
    },
    {
      "title": "Car Damages Detection",
      "stack": ["Computer Vision", "Python"],
      "description": "The project focused on semantic segmentation for vehicle damage detection. Using a dataset from Roboflow and various metrics, it enabled the training and testing of both state-of-the-art and custom architectures.",
      "image": "assets/projects/VehiclesDamagesDetection.png",
      "url": "https://github.com/MrCharlesSG/Vehicles-Damages-Detection"
    },
    
    {
      "title": "Universitary Events",
      "stack": ["Express.js", "HTML", "Bootstrap"],
      "description": "A social media platform for events, built with Express.js and vanilla JavaScript on the frontend. It features authentication and authorization with two distinct user roles. Users can create and manage their own events, register for others, and enjoy a variety of additional features.",
      "image": "assets/projects/EventosUniv.png",
      "url": "https://github.com/MrCharlesSG/EventosUniversitariosAW"
    },
    {
      "title": "Llama ChatBot",
      "stack": ["LLM", "Spring Boot", "Next.js"],
      "description": "This project is a full-stack web application that combines a Spring Boot backend with a Next.js frontend, designed to facilitate chatbot interactions. The chatbot provides real-time information such as currency exchange rates and weather updates for cities worldwide.",
      "image": "assets/projects/LlamaChatBot.png",
      "url": "https://github.com/MrCharlesSG/LlamaChatBot"
    },
    {
      "title": "Cryptographic Chat",
      "stack": ["Cryptography", "Python", "Flask"],
      "description": "This project addresses the need for a secure, end-to-end system where only users involved in a conversation can access the content of their chats. Neither the server nor potential attackers can decipher the communication. The objective is to uphold the five pillars of CIANA, as defined by NIST: Confidentiality, Integrity, Availability, Authentication, and Non-repudiation.",
      "image": "assets/projects/CryptographicChat.png",
      "url": "https://github.com/MrCharlesSG/CryptographicChat"
    },
    {
      "title": "Ecommerce App",
      "stack": ["Android", "Kotlin", "Firebase"],
      "description": "This e-commerce app is built in Kotlin, allowing users to log in, create a wishlist, and browse products fetched from a public API. The backend database is managed using Firebase.",
      "image": "assets/projects/EcommerceApp.png",
      "url": "https://github.com/MrCharlesSG/EcommerceAndroid"
    },
    
    {
      "title": "Algoritmic Techniques",
      "stack": ["C++", "Algorithms", "Data Structures"],
      "description": "A collection of algorithms covering various paradigms, including graph algorithms (Kruskal, Dijkstra), greedy methods, dynamic programming, backtracking, and divide-and-conquer techniques.",
      "image": "assets/projects/Algorithms.png",
      "url": "https://github.com/MrCharlesSG/Algorithmic-Techniques"
    },
    {
      "title": "DevOps Notes",
      "stack": ["Kubernetes", "Docker"],
      "description": "A collection of notes and resources for DevOps exam preparation, covering Kubernetes, Docker, and application deployment. Includes detailed labs, troubleshooting tips, and practical insights to strengthen understanding of containerization and Kubernetes management.",
      "image": "assets/projects/DevOpsNotes.png",
      "url": "https://github.com/MrCharlesSG/DevOps-Notes"
    }
  ],
  "education": [
    {
      "period": "2021 - 2023",
      "title": "Software Engineering",
      "institution": "Complutense University of Madrid, Spain"
    },
    {
      "period": "2023 - 2024",
      "title": "Software Engineering",
      "institution": "Algebra University of Zagreb, Croatia"
    },
    {
      "period": "2024 - 2025",
      "title": "Software Engineering",
      "institution": "Complutense University of Madrid, Spain"
    }
  ],
  "experience": [
    {
      "period": "2025 - Today",
      "title": "Cybersecurity Advisory Intern",
      "company": "PricewaterhouseCoopers, Madrid, Spain"
    }
  ],
  "quote": {
    "text": "Acknowledging your weaknesses is not the same as surrendering to them.",
    "author": "Ray Dalio",
    "image": "assets/img/quote.jpg"
  },
  "about": {
    "name": "Carlos Serrano Gutiérrez",
    "title": "Software Engineer with a Cybersecurity Mindset",
    "description": "I'm a software engineer passionate about building secure, scalable solutions with a strong interest in business and software developmen. I love creating software that is not only functional but also resilient. With  a radical open-minded and disciplined approach, I continuously seek to improve, adapt, and make better decisions, bridging the gap between technology, business needs, and real-world applications.",
    "image": "assets/img/personal-foto.jpeg"
  },

  "home": {
    "name": "Carlos<br>Serrano Gutiérrez",
    "subtitle": "Passionate about <em class='text-primary-light'>developing secure solutions</em>, and committed to continuous growth with <em class='text-primary-light'>discipline</em>.",
    "resume": "/assets/CV_Carlos_Serrano_Gutierrez.pdf"
  }
  ,
  "certifications": [
    {
      "title": "Cambridge Advanced Certificate (CAE)",
      "description": "An internationally recognized English language certification that assesses high-level proficiency in reading, writing, listening, and speaking. It demonstrates the ability to communicate effectively in professional and academic settings."
    },
    {
      "title": "Attendance Red Hat OpenShift Administration I: Operating a Production Cluster (DO180)",
      "description": "An introductory course focused on managing and operating an OpenShift cluster in a production environment. Covers container orchestration, deployment automation, and troubleshooting techniques for Kubernetes-based applications."
    },
    {
      "title": "Problem Solving with Excel",
      "description": "A PwC certification that covers advanced Excel techniques for data analysis and problem-solving. Topics include data structuring, financial modeling, and the use of functions to enhance business decision-making."
    },
    {
      "title": "Data-Driven Decision Making",
      "description": "A PwC certification that provides insights into leveraging data for strategic decision-making. Covers key analytical methodologies, visualization techniques, and frameworks for making informed business choices."
    }
  ]
}